Repository: rllyhz/DailyUs-flutter
Catalog: lib/l10n/app_*.arb
Languages: id

# dateUnknown
source: UnknownTime
id: WaktuTidakDiketahui

# dateInJustNow
source: Just now
id: Baru saja

# dateInSeconds
source: {second}s ago
id: {second} detik

# dateInMinutes
source: {minute}m ago
id: {minute} menit

# dateInHours
source: {hour}h ago
id: {hour} jam

# dateInDays
source: {day}d ago
id: {day} hari

# onBoardingSubHeading
source: Express Your Memories By Sharing Them With The World
id: Ekspresikan Kenanganmu Dengan Membagikannya Pada Dunia

# homeGreetingUser
source: Hello, {user}!
id: Halo, {user}!

# homeGreetingUserExample
source: Hello, Rully!
id: Halo, Rully!

# homeGreetingHeadline
source: Share Your Memories Today.
id: Bagikan Kenanganmu Hari Ini.

# postPreviewPhotoLabel
source: Photo Preview
id: Hasil foto

# titleRegister
source: Register
id: Daftar

# titleLogin
source: Login
id: Masuk

# titleHome
source: Home
id: Beranda

# titlePost
source: Post
id: Post Story

# titleSettings
source: Settings
id: Pengaturan

# buttonRegister
source: Register
id: Daftar

# buttonLogin
source: Login
id: Masuk

# buttonLogout
source: Logout
id: Keluar

# buttonUpload
source: Upload
id: Buat Story

# buttonChangeLanguage
source: Change language
id: Ubah bahasa

# buttonTakePicture
source: Camera
id: Kamera

# buttonPickFromGallery
source: Gallery
id: Galeri

# nameHint
source: Name
id: Nama

# descriptionHint
source: Give it some description
id: Berikan deskripsi...

# dialogTitleRegisterSuccess
source: Succesfully registered
id: Berhasil mendaftar

# dialogMessageRegisterSuccess
source: You have been registered! Please login and make your amazing story right now
id: Kamu telah terdaftar! Silahkan login dan buatlah ceritamu yang berkesan

# dialogPositiveActionRegisterSuccess
source: Oke
id: Baik

# dialogTitleLogoutConfirm
source: Are you sure want to leave?
id: Apakah kamu yakin keluar?

# dialogMessageLogoutConfirm
source: You will need to login again in order to access the application if you continue this process.
id: Kamu nantinya perlu melakukan proses login lagi untuk mengakses aplikasi jika melanjutkan proses ini.

# dialogPositiveActionLogoutConfirm
source: Oke
id: Baik

# dialogNegativeActionLogoutConfirm
source: Cancel
id: Batal

# dialogTitleQuitConfirm
source: Close the app!
id: Keluar dari aplikasi!

# dialogMessageQuitConfirm
source: Are you sure want to exit the app?
id: Apakah kamu yakin ingin keluar dari aplikasi?

# dialogPositiveActionQuitConfirm
source: Oke
id: Baik

# dialogNegativeActionQuitConfirm
source: Cancel
id: Batal

# nameEmptyMessage
source: Name must not be empty
id: Nama tidak boleh kosong

# emailEmptyMessage
source: E-mail must not be empty
id: E-mail tidak boleh kosong

# passwordEmptyMessage
source: Password must not be empty
id: Password tidak boleh kosong

# descriptionEmptyMessage
source: Description must not be empty
id: Deskripsi tidak boleh kosong

# photoEmptyMessage
source: Upload a photo first
id: Unggah foto terlebih dahulu

# nameInvalidMessage
source: Name is not valid
id: Nama tidak valid

# emailInvalidMessage
source: E-mail is not valid
id: E-mail tidak valid

# passwordInvalidMessage
source: Password is not valid
id: Password tidak valid

# passwordInvalidFormatMessage
source: Password must have at least 6 chars
id: Password harus setidaknya 6 karakter

# wrongCredentialMessage
source: Wrong email or password
id: Email atau password salah

# emailAlreadyTakenMessage
source: Email has already taken
id: Email sudah terdaftar

# internalErrorMessage
source: Sorry, it went wrong internally
id: Maaf, telah terjadi kesalahan

# loginSuccessMessage
source: Succesfully logged in
id: Berhasil masuk

# uploadSuccessMessage
source: Succesfully added new stories
id: Berhasil menambahkan story baru

# uploadFailedMessage
source: Failed to add new stories
id: Gagal menambahkan story

# noConnectionMessage
source: No internet connection
id: Tidak ada koneksi internet

# storyNotFoundMessage
source: Story not found
id: Cerita tidak ditemukan

# languageEn
source: English
id: Inggris
